rails/scheduled_tweets/app/views/tweets/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT 1 AS one FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
---

  <% if Current.user.twitter_accounts.any? %>

SELECT 1 AS one FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = $1 LIMIT $2  [["user_id", 4], ["LIMIT", 1]]
---

<% if Current.user.twitter_accounts.none? %>