rails/assignment/assignment/app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "avatar", "gender", "about", "password", "country", "created_at", "updated_at", "favourite_music") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
  def api
    url = "https://reqres.in/api/users?page=1"
    response = RestClient.get(url)
    data_h = JSON.parse(response)
    print data_h.keys

    data_h['data'].each do |user|
      @email = user['email']
      @first_name = user['first_name']
      @last_name = user['last_name']
      @avatar = user['avatar']
      @user = User.new(email: @email, first_name: @first_name, last_name: @last_name, avatar: @avatar)

      if @user.save

UPDATE "users" SET "last_name" = $1, "password" = $2, "country" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["last_name", "Smith"], ["password", "[FILTERED]"], ["country", "India"], ["updated_at", "2022-07-08 13:20:42.131055"], ["id", 122]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)