rails/scheduled_tweets/app/controllers/omniauth_callbacks_controller.rb

  def twitter
    Rails.logger.info auth

    twitter_account = Current.user.twitter_accounts.where(username: auth.extra.access_token.params[:screen_name]).first_or_initialize
    twitter_account.update(
      name: auth.extra.access_token.params[:screen_name],
      username: auth.extra.access_token.params[:screen_name],
      image: auth.info.image,
      token: auth.credentials.token,
      secret: auth.credentials.secret
    )
---
SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."user_id" = $1 AND "twitter_accounts"."username" = $2 ORDER BY "twitter_accounts"."id" ASC LIMIT $3  [["user_id", 4], ["username", "Jaskara59294857"], ["LIMIT", 1]]
UPDATE "twitter_accounts" SET "token" = $1, "secret" = $2, "updated_at" = $3 WHERE "twitter_accounts"."id" = $4  [["token", "[FILTERED]"], ["secret", "[FILTERED]"], ["updated_at", "2022-07-04 10:14:08.496817"], ["id", 2]]