rails/scheduled_tweets/app/controllers/tweets_controller.rb

  def create
    @tweet = Current.user.tweets.new(tweet_params)
    if @tweet.save
---
INSERT INTO "tweets" ("user_id", "twitter_account_id", "body", "publish_at", "tweet_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    if @tweet.update(tweet_params)
---
UPDATE "tweets" SET "body" = $1, "publish_at" = $2, "updated_at" = $3 WHERE "tweets"."id" = $4  [["body", "Using twitter"], ["publish_at", "2022-10-04 04:43:00"], ["updated_at", "2022-07-04 10:33:43.832489"], ["id", 3]]

  def set_tweet
    @tweet = Current.user.tweets.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = $1 AND "tweets"."id" = $2 LIMIT $3  [["user_id", 4], ["id", 1], ["LIMIT", 1]]