assignment/sms/app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE (name ILIKE '%diablo%') ORDER BY price desc LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "products" WHERE (name ILIKE '%s%')
---
  def index
    @products = Product.search(params[:search]).order(sort_column + " " + sort_direction).paginate(:per_page => 5, :page => params[:page])