assignment/lms/app/views/authors/index.html.erb

SELECT "authors".* FROM "authors"
---
<%= form_tag searching_authors_path, :method => 'get', remote: true do %>
  Skill<%= collection_select :@author, :id, Author.all, :id, :skill, prompt: true %>

SELECT "books".* FROM "books" WHERE "books"."author_id" = $1  [["author_id", 22]]
---
  <tr><td><b>Books</b></td></tr><br>
  <% author.books.each do |book| %>