assignment/lms/app/views/authors/index.html.erb

SELECT "authors".* FROM "authors"
---
<%= form_with do |f| %>
  <% f.select :author, ["Global", "Legacy", "Forward"] %>

SELECT "authors".* FROM "authors"
---
<%= form_tag searching_authors_path, :method => 'get', remote: true do %>
  <%= collection_select :@author, :id, Author.all, :id, :hobby, prompt: true %>

SELECT "authors"."hobby" FROM "authors"
---
Hobby
<%= select_tag(:hobby, options_for_select(Author.pluck("hobby").flatten.uniq(), params[:hobby]), class:"select") %>

SELECT "authors"."skill" FROM "authors"
---
Hobby
<%= select_tag(:skill, options_for_select(Author.pluck("skill").flatten.uniq()), class:"select") %>

SELECT "books".* FROM "books" WHERE "books"."author_id" = $1  [["author_id", 4]]
---
  <tr><td><b>Books</b></td></tr><br>
  <% author.books.each do |book| %>