assignment/lms/app/views/authors/index.html.erb

SELECT "books".* FROM "books" WHERE "books"."author_id" = $1  [["author_id", 1]]
---
  <tr><td><b>Books</b></td></tr><br>
  <% author.books.each do |book| %>