rails/rails5/rrs/app/views/users/new.html.erb

    <%= form.label :country_id %><br />
    <%= form.collection_select :id, Country.order(:name), :id, :name, include_blank: true %>
---
SELECT "countries".* FROM "countries" ORDER BY "countries"."name" ASC

    <%= form.label :city_id, "City" %>
    <%= form.grouped_collection_select :id, Country.order(:name), :cities, :name, :id, :name, include_blank: true %>
---
SELECT "cities".* FROM "cities" ORDER BY "cities"."name" ASC
SELECT "countries".* FROM "countries" ORDER BY "countries"."name" ASC