rails/assignment/assignment/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."first_name" = $1 LIMIT $2  [["first_name", "Jas"], ["LIMIT", 1]]
---
  def self.search(search)
    if search
      user_type = User.find_by(first_name: search)