rails/assignment/assignment/app/controllers/api/v1/users_controller.rb

  def index
    users = User.all.order(:id)
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC