rails/rails5/Image_uploader/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "address", "gender", "profile", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Sam"], ["address", "USA"], ["gender", "Male"], ["profile", ""], ["created_at", "2022-07-13 13:53:15.079149"], ["updated_at", "2022-07-13 13:53:15.079149"]]