assignment/lms/app/controllers/authors_controller.rb

SELECT "authors".* FROM "authors"
---
  def index
    @author = Author.all

INSERT INTO "authors" ("name", "email", "phone_no", "dob", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @author = Author.new(author_params)
    if @author.save

SELECT "authors".* FROM "authors" WHERE (name ILIKE '%FELICIDAD%')
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def searching
    if params[:name]
      @authors = Author.where('name ILIKE ?', "%#{params[:name]}%")
    elsif  params["@author"]
      author = params["@author"]
      y = author[:id].to_i
      @authors = Author.where('id = ?', "#{y}")
    else
    @authors = Author.all

SELECT "authors".* FROM "authors" WHERE (hobby LIKE'%Product%')
---
  def hobby
    if params[:hobby]
      @authors = Author.include?("%#{params[:hobby]}%")

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def delete
    @author = Author.find(params[:id])

SELECT "books".* FROM "books" WHERE (title ILIKE '%a time%')
SELECT "books".* FROM "books"
---
  def search
    if params[:title]
      @book = Book.where('title ILIKE ?', "%#{params[:title]}%")
      #redirect_to 'authors/search.js.erb'
    else
   @book = Book.all

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "authors" SET "hobby" = $1, "skill" = $2, "updated_at" = $3 WHERE "authors"."id" = $4  [["hobby", "{}"], ["skill", "{}"], ["updated_at", "2022-07-28 18:11:20.499881"], ["id", 3]]
---
  def update
    @author = Author.find(params[:id])
    if @author.update(authors_params)

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def author_info
    @author = Author.find(params[:id].to_i)

SELECT  "authors".* FROM "authors" WHERE "authors"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = $1  [["id", 1]]
---
  def destroy
    @author = Author.find(params[:id])
    @author.destroy