assignment/lms/app/controllers/authors_controller.rb

SELECT  "authors".* FROM "authors" LIMIT $1 OFFSET $2  [["LIMIT", 2], ["OFFSET", 0]]
SELECT COUNT(*) FROM "authors"
---
  def index
    @author = Author.paginate(page: params[:page], per_page: 2)

SELECT "authors".* FROM "authors" WHERE ('Networking skills' = ANY (skill))
---
  def skill
    if params[:skill]
      @authors = Author.where("'#{params[:skill]}' = ANY (skill)")

SELECT "authors".* FROM "authors" WHERE (age < '%Age > 50%')
---
  def age
    if params[:age]
      @authors = Author.where("#{params[:age]}")