rails/rails5/rrs/app/controllers/welcome_controller.rb

SELECT  "cities".* FROM "cities" WHERE (id = NULL) LIMIT $1  [["LIMIT", 1]]
---
  def show
    @city = City.find_by("id = ?", params[:city_id])