rails/scheduled_tweets/app/controllers/api/v1/twitter_accounts_controller.rb

SELECT "twitter_accounts".* FROM "twitter_accounts"
---
  def index
    twitter_accounts = TwitterAccount.all

SELECT "twitter_accounts".* FROM "twitter_accounts" WHERE "twitter_accounts"."id" = $1 LIMIT $2  [["id", 43], ["LIMIT", 1]]
---
  def show
    twitter_account = TwitterAccount.find_by(id: params[:id])