rails/assignment/rails-jwt/app/controllers/users_controller.rb

  def find_user
    @user = User.find_by_username!(params[:_username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "usertwo"], ["LIMIT", 1]]