rails/rails5/ars/app/views/people/new.html.erb

    <%= f.label :country_id %><br />
    <%= f.collection_select :country_id, Country.order(:name), :id, :name, include_blank: true %>
---
SELECT "countries".* FROM "countries" ORDER BY "countries"."name" ASC

    <%= f.label :state_id, "State or Province" %><br />
    <%= f.grouped_collection_select :state_id, Country.order(:name), :states, :name, :id, :name, include_blank: true %>
---
SELECT "countries".* FROM "countries" ORDER BY "countries"."name" ASC